accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/payments/GetPaymentInformation-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/AccountManagement/GetPaymentInformation">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetPaymentInformationResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <get:ListOfPaymentsHist>
                  <!--Zero or more repetitions:-->
                  <get:Payment>
                     <!--Optional:-->
                     <get:PaymentID>?</get:PaymentID>
                     <!--Optional:-->
                     <get:PaymentAmount>?</get:PaymentAmount>
                     <!--Optional:-->
                     <get:PaymentDate>?</get:PaymentDate>
                     <!--Optional:-->
                     <get:PaymentMethod>?</get:PaymentMethod>
                     <!--Optional:-->
                     <get:PaymentChannel>?</get:PaymentChannel>
                     <!--Optional:-->
                     <get:ListOfinvoice>
                        <!--Zero or more repetitions:-->
                        <get:Invoice>
                           <!--Optional:-->
                           <get:InvoicePaid>?</get:InvoicePaid>
                           <!--Optional:-->
                           <get:AppliedAmount>?</get:AppliedAmount>
                        </get:Invoice>
                     </get:ListOfinvoice>
                  </get:Payment>
               </get:ListOfPaymentsHist>
            </lcew:Body>
         </Response>
      </web:GetPaymentInformationResponse>
   </soapenv:Body>
</soapenv:Envelope>